БПКР/src/Catalogs/Статусы/Статусы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Статусы</name>
  <predefined>
    <items>
      <name>НерезидентПенсионер</name>
      <description>Нерезидент-пенсионер</description>
    </items>
    <items>
      <name>Основной</name>
      <description>Основной</description>
    </items>
  </predefined>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗанятости</name>
    <type>
      <types>CatalogRef.ВидыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиВОтчетеПН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодРасчетаПН</name>
    <type>
      <types>EnumRef.МетодыРасчетаПН</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодРасчетаСФ</name>
    <type>
      <types>EnumRef.МетодыРасчетаСФ</types>
    </type>
  </attributes>
</mdclass:Catalog>

БПКР/src/Catalogs/Статусы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	Настройки.ИмяКлючевогоРеквизита = "Наименование";
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника ПапкиФайлов.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	СправочникМенеджер = Справочники.Статусы;
	
	КлассификаторXML = СправочникМенеджер.ПолучитьМакет("МакетЗаполнения").ПолучитьТекст();
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("ИмяПредопределенныхДанных", СтрокаТаблицыЗначений.ИмяПредопределенныхДанных);
		ЗначенияЗаполнения.Вставить("Предопределенный", ЗначениеЗаполнено(СтрокаТаблицыЗначений.ИмяПредопределенныхДанных));
		ЗначенияЗаполнения.Вставить("Наименование", СтрокаТаблицыЗначений.Наименование);
		ЗначенияЗаполнения.Вставить("Категория", Справочники.КатегорииСотрудников.НайтиПоКоду(СтрокаТаблицыЗначений.Категория));
		ЗначенияЗаполнения.Вставить("ВидЗанятости", Справочники.ВидыЗанятости[СтрокаТаблицыЗначений.ВидЗанятости]);
		ЗначенияЗаполнения.Вставить("МетодРасчетаПН", Перечисления.МетодыРасчетаПН[СтрокаТаблицыЗначений.МетодРасчетаПН]);
		ЗначенияЗаполнения.Вставить("МетодРасчетаСФ", Перечисления.МетодыРасчетаСФ[СтрокаТаблицыЗначений.МетодРасчетаСФ]);
		
		Элемент = Элементы.Добавить();
		ЗаполнитьЗначенияСвойств(Элемент, ЗначенияЗаполнения);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
